---
kind: type
id: T:Autodesk.Revit.DB.Lighting.InitialIntensity
source: html/557d9e25-430a-2f92-3dbc-c9ec84e07900.htm
---
# Autodesk.Revit.DB.Lighting.InitialIntensity

This class is the base class for calculating lighting initial intensity.

## Syntax (C#)
```csharp
public class InitialIntensity : IDisposable
```